Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/tdd_ita-level2.tmx
Source language: en_us
Languages: it_it

source: Instead of the call to SelectAllOrders(), mocks created by NSubstitute record all calls received and allow us to use a special method called Received() on them (see the last line of this test), which is actually a camouflaged assertion that checks whether the Insert() method was called with the order object as parameter.
it_it: Invece della chiamata a SelectAllOrders(), i mock creati da NSubstitute registrano tutte le chiamate ricevute e ci permettono di usare su di esse un metodo speciale chiamato Received() (vedi l'ultima riga di questo test), che in realtà è un'asserzione camuffata che controlla se il metodo Insert() è stato chiamato con l'oggetto order come parametro.

source: Is learning TDD a high priority for you?
it_it: Imparare il TDD è una priorità?

source: Isn't that something worth aiming for?
it_it: Non è qualcosa a cui vale la pena puntare?

source: It hurts so bad, because we wanted our tests to prove something works, but it looks like it can fail even when the logic is coded correctly.
it_it: Fa così male, perché volevamo che i nostri test dimostrassero che qualcosa funziona, ma sembra che possa fallire anche quando la logica è codificata correttamente.

source: It is an example of a so-called anonymous values generator (although its creator likes to say that it is also an implementation of the Test Data Builder pattern, but let's skip this discussion here).
it_it: È un esempio del cosiddetto generatore di valori anonimi (anche se al suo creatore piace dire che è anche un'implementazione del pattern Test Data Builder, ma saltiamo questa discussione qui).

source: It is because each fighter in the game had a lot of combos, kicks, and punches that could be mixed in a variety of ways.
it_it: È perché ogni combattente nel gioco aveva molte combinazioni, calci e pugni che potevano essere mescolati in vari modi.

source: It is not uncommon to have more than a thousand tests in a suite and I don't want to wait half an hour for results every time I run them.
it_it: Non è raro avere più di mille test in una suite e non voglio aspettare mezz'ora per i risultati ogni volta che li eseguo.

source: It is possible, but requires significant effort (e.g. deleting a table and recreating it after the test, for use by other tests that might need it to run correctly), which may lead some to the conclusion that it is not worth writing such tests at all.
it_it: È possibile, ma richiede uno sforzo significativo (ad esempio eliminare una tabella e ricrearla dopo il test, per utilizzarla da altri test che potrebbero aver bisogno che venga eseguita correttamente), il che potrebbe portare alcuni alla conclusione che non vale affatto la pena scrivere tali test.

source: It looks simple, isn't it?
it_it: Sembra semplice, vero?

source: It provides an API in a form of C# extension methods, which is why it might seem a bit magical at first, especially if you're not familiar with C#.
it_it: Fornisce un'API sotto forma di metodi di estensione di C#, motivo per cui all'inizio potrebbe sembrare un po' magico, soprattutto se non hai familiarità col C#.

source: It was there only to make writing the test easier -- no production code used it.
it_it: Era lì solo per rendere più semplice la scrittura del test: nessun codice di produzione lo utilizzava.

source: It works like this: the type of the interface we want to have implemented is usually passed to a special method which returns a mock object based on that interface (we'll see an example in a few seconds).
it_it: Funziona così: il tipo di interfaccia che vogliamo implementare viene solitamente passato a un metodo speciale che restituisce un oggetto mock basato su quell'interfaccia (vedremo un esempio tra qualche secondo).

source: It's called Autofixture.
it_it: Si chiama Autofixture.

source: I can already see you shake your head and say: "Let's just create a database connection, invoke the Place() method and see if the record is added properly into the database".
it_it: Vedo già che scuoti la testa e dici: "Creiamo semplicemente una connessione al database, invochiamo il metodo Place() e vediamo se il record viene aggiunto correttamente nel database".

source: Just make another fake class, implemented like this:
it_it: Basta creare un'altra classe fake, implementata in questo modo:

source: Knowing that TDD is valued and praised by others, we may conclude that it has to be good for us as well.
it_it: Sapendo che il TDD è apprezzato e lodato dagli altri, possiamo concludere che deve essere positivo anche per noi.

source: Let's assume for the sake of this introduction that we have an application that accepts two numbers from the command line, multiplies them and prints the result on the console.
it_it: Supponiamo ai fini di questa introduzione di avere un'applicazione che accetta due numeri dalla riga di comando, li moltiplica e stampa il risultato sulla console.

source: Let's assume that the MySqlOrderDatabase that queries a real database query is already tested (this is because I don't want to get into a discussion on testing database queries just yet -- we'll get to it in later chapters) and that the only thing we need to test is the OrderProcessing class (remember, we're trying to imagine really hard that there is some serious domain logic coded here).
it_it: Supponiamo che MySqlOrderDatabase che esegue una query su un database reale sia già testato (questo perché non voglio ancora entrare in una discussione sul test delle query di database: ci arriveremo tra capitoli successivi) e che l'unica cosa che dobbiamo testare è la classe OrderProcessing (ricordate, stiamo cercando di immaginare davvero che ci sia una logica di dominio seria codificata qui).

source: Let's get it started!
it_it: Cominciamo!

source: Let's pretend that we have a class that allows placing orders and then puts these orders into a database (using an implementation of an interface called OrderDatabase).
it_it: Supponiamo di avere una classe che consenta di effettuare ordini e poi di inserire questi ordini in un database (utilizzando un'implementazione di un'interfaccia chiamata OrderDatabase).

source: Let's reiterate the three elements of the previous version of the test that I promised would be present after the transition to the test framework:
it_it: Ribadiamo i tre elementi della versione precedente del test che avevo promesso sarebbero stati presenti dopo la transizione al framework di test:

source: Let's replace the real implementation of the order database by the fake instance in the test:
it_it: Sostituiamo la reale implementazione del database degli ordini con l'istanza fake nel test:

source: Let's take one last round and extract the test itself so that its code is in a separate method.
it_it: Facciamo un ultimo giro ed estraiamo il test stesso in modo che il suo codice sia in un metodo separato.

source: Looking at the example, we can see that the test method itself is the only thing that's left -- the two methods (the test list and assertion) that we previously had are gone now.
it_it: Guardando l'esempio, possiamo vedere che il metodo di test stesso è l'unica cosa rimasta: i due metodi (l'elenco di test e l'asserzione) che avevamo in precedenza ora non ci sono più.

source: Looking at the test data in the previous section we see that many values are specified literally, e.g. in the following code:
it_it: Osservando i dati del test nella sezione precedente vediamo che molti valori sono specificati letteralmente, ad es. nel seguente codice:

source: Mocking frameworks are not as old as test frameworks so they haven't been used in TDD since the very beginning.
it_it: I framework di mocking non sono vecchi quanto i framework di test, quindi non sono stati utilizzati in TDD sin dall'inizio.

source: Moreover, they are far more advanced than what we have.
it_it: Inoltre, sono molto più avanzati di quelli che abbiamo.

source: Motivation -- the first step to learning TDD
it_it: Motivazione: il primo passo per imparare il TDD

source: My brother and I liked to play video games in our childhood -- one of the most memorable being Tekken 3 -- a Japanese tournament beat'em up for Sony Playstation.
it_it: A me e mio fratello piaceva giocare ai videogiochi da bambini, uno dei più memorabili è stato Tekken 3, un torneo giapponese di picchiaduro per la Sony Playstation.

source: Narrowing it down to C# -- a mocking framework is just that -- a mechanism that allows us to create objects (called "mock objects" or just "mocks"), that adhere to a certain interface, at runtime.
it_it: Restringendo il campo al C#, un framework di mocking è proprio questo, un meccanismo che ci consente di creare oggetti (chiamati "oggetti mock" o semplicemente "mock"), che aderiscono a una determinata interfaccia, in fase di esecuzione.

source: Nice, huh?
it_it: Bello, eh?

source: No wonder that soon many tournaments sprang, where players could clash for glory, fame, and rewards.
it_it: Non c'è da stupirsi che presto sorsero molti tornei, dove i giocatori potevano scontrarsi per la gloria, la fama e le ricompense.

source: Not only did we make the test shorter, we also provided a hint to the reader that the actual values used to create an order don't matter from the perspective of tested order-processing logic.
it_it: Non solo abbiamo abbreviato il test, ma abbiamo anche fornito al lettore un suggerimento sul fatto che i valori effettivi utilizzati per creare un ordine non contano dal punto di vista della logica testata dell'elaborazione degli ordini.

source: Note that I started the name of this extracted method with "Assert" -- we will get back to the naming soon, for now just assume that this is a good name for a method that verifies that a result matches our expectation.
it_it: Tieni presente che ho iniziato il nome di questo metodo estratto con "Assert": torneremo presto sulla nomenclatura, per ora presupponiamo solo che questo sia un buon nome per un metodo che verifica che un risultato corrisponda alle nostre aspettative.

source: Note that the fake order database is an instance of a custom class that implements the same interface as MySqlOrderDatabase.
it_it: Tieni presente che il database fake degli ordini è un'istanza di una classe personalizzata che implementa la stessa interfaccia di MySqlOrderDatabase.

source: Note that the test we wrote is only one out of two.
it_it: Tieni presente che il test che abbiamo scritto è solo uno su due.

source: Note that we do not clean the fake database object as we did with the real database since we create a fresh object each time the test is run and the results are stored in a memory location different for each instance.
it_it: Tieni presente che non puliamo l'oggetto del database fake come abbiamo fatto con il database reale poiché creiamo un nuovo oggetto ogni volta che viene eseguito il test e i risultati vengono archiviati in una posizione di memoria diversa per ogni istanza.

source: Note that we don't need the SelectAllOrders() method on the database connection interface anymore.
it_it: Tieni presente che non abbiamo più bisogno del metodo SelectAllOrders() sull'interfaccia di connessione al database.

source: Now if we need another test, e.g. for division, we can just add a new method call to the Main() method and implement it.
it_it: Ora, se abbiamo bisogno di un altro test, ad es. per la divisione, possiamo semplicemente aggiungere una nuova chiamata al metodo Main() e implementarla.

source: Now that the test is ready, did we get what we wanted from it?
it_it: Ora che il test è pronto, abbiamo ottenuto ciò che volevamo?

source: Now the last thing to add -- as there is no Main() method anymore in the last example, you surely must wonder how we run those tests, right?
it_it: Ora l'ultima cosa da aggiungere: poiché nell'ultimo esempio non esiste più il metodo Main(), ti starai sicuramente chiedendo come eseguiamo questi test, giusto?

source: Now, imagine we need to test it -- how do we do that?
it_it: Ora, immaginiamo di doverlo testare: come lo facciamo?

source: Now, let's assume we want to check whether this application produces correct results.
it_it: Supponiamo ora di voler verificare se questa applicazione produce risultati corretti.

source: Now, let's try to approach this problem differently.
it_it: Ora proviamo ad affrontare questo problema in modo diverso.

source: Now, let's use this code as a basis to build a very primitive test framework, just to show the pieces that such frameworks consist of.
it_it: Ora, utilizziamo questo codice come base per costruire un framework di test molto primitivo, solo per mostrare le parti di cui sono costituiti tali framework.

source: Now, that's better.
it_it: Adesso va meglio.

source: Now, we don't have to create additional classes for new scenarios, but our syntax becomes awkward.
it_it: Ora non dobbiamo creare classi aggiuntive per nuovi scenari, ma la nostra sintassi diventa scomoda.

source: Now, what if the application also performed addition, subtraction, division, calculus, etc.?
it_it: E se l'applicazione eseguisse anche addizioni, sottrazioni, divisioni, calcoli, ecc.?

source: Nowadays, we can rely on tools to generate such a "fake" implementation of a given interface for us and let us use this generated implementation in place of a real object in tests.
it_it: Al giorno d'oggi, possiamo fare affidamento su strumenti per generare per noi un'implementazione "fake" di una determinata interfaccia e consentirci di utilizzare questa implementazione generata al posto di un oggetto reale nei test.

source: Of course, no one stops you from writing your custom assertion if the built-in assertion methods don't offer what you are looking for.
it_it: Naturalmente, nessuno ti impedisce di scrivere la tua asserzione personalizzata se i metodi di asserzione integrati non offrono ciò che stai cercando.

source: Of what use would be such a test if it couldn't reliably tell us whether the implemented logic is correct or not?
it_it: A cosa servirebbe un test del genere se non potesse dirci in modo affidabile se la logica implementata è corretta o meno?

source: Ok, so far so good, but now we have two classes of fake objects to maintain (and chances are we will need even more).
it_it: Ok, fin qui tutto bene, ma ora abbiamo due classi di oggetti fake da mantenere (e probabilmente ne avremo bisogno ancora di più).

source: Ok, the last big secret unveiled -- we use an external application for this (we will refer to it using the term Test Runner) -- we tell it which assemblies to run and then it loads them, runs them, reports the results, etc.
it_it: Ok, l'ultimo grande segreto svelato: utilizziamo un'applicazione esterna per questo (ci riferiremo ad essa utilizzando il termine Test Runner) -- gli diciamo quali assembly eseguire e poi li carica, li esegue, riporta i risultati, ecc.

source: Okay, I'm just teasing, but as some say, TDD is "easy to learn, hard to master"^easytolearn, so without some grit to move on, it will be difficult.
it_it: Ok, sto solo scherzando, ma come dicono alcuni, il TDD è "facile da imparare, difficile da padroneggiare"^easytolearn, quindi senza un po' di coraggio per andare avanti, sarà difficile.

source: On the other hand, when we look at the tested code again:
it_it: D'altra parte, quando guardiamo di nuovo il codice testato:

source: One such a library is NSubstitute.
it_it: Una di queste librerie è NSubstitute.

source: Or look at the first Rocky film (yeah, the one starring Sylvester Stallone), where Rocky chases a chicken to train agility.
it_it: Oppure guarda il primo film di Rocky (sì, quello con Sylvester Stallone), in cui Rocky insegue un pollo per migliorare l'agilità.

source: OrderDatabase _orderDatabase; //OrderDatabase is an interface
it_it: OrderDatabase _orderDatabase; //OrderDatabase è un'interfaccia

source: Ouch!
it_it: Ahia!

source: Over time, I have noticed that some of us (myself included) may think we need to learn something (as opposed to wanting to learn something) for various reasons, such as getting a promotion at work, gaining a certificate, adding something to our CV, or just "staying up to date" with recent hypes.
it_it: Nel corso del tempo, ho notato che alcuni di noi (me compreso) potrebbero pensare che ci sia bisogno di imparare qualcosa (invece di voler imparare qualcosa) per vari motivi, come ottenere una promozione sul lavoro, ottenere un certificato, aggiungere qualcosa al nostro CV, o semplicemente "rimanere aggiornato" con le ultime novità.

source: Phew, I hope I made the transition quite painless for you.
it_it: Uff, spero di aver reso la transizione abbastanza indolore per te.

source: Rather, I'd like you to reconsider the goal you want to achieve by reading it.
it_it: Piuttosto, vorrei che si tenesse presente l'obiettivo da raggiungere leggendolo.

source: Remember that a database provides persistent storage.
it_it: Ricorda che un database fornisce spazio di archiviazione permanente.

source: Should we re-run our database creation script only to ensure we have got the latest schema available to run your tests against?
it_it: Dovremmo eseguire nuovamente il nostro script di creazione del database solo per assicurarci di avere lo schema più recente disponibile su cui eseguire i test?

source: So here goes:
it_it: Quindi ecco qui:

source: So we can write programs to do the testing for us!
it_it: Quindi possiamo scrivere programmi che eseguano i test per noi!

source: So, instead of explaining how to win a race, in this chapter we will take a look at what shiny cars we will be driving.
it_it: Quindi, invece di spiegare come vincere una gara, in questo capitolo daremo un'occhiata a quali automobili scintillanti guideremo.

source: So, to make sure that the state of the persistent storage is the same every time we run this test, we clean up the database before each run.
it_it: Pertanto, per garantire che lo stato dell'archiviazione persistente sia lo stesso ogni volta che eseguiamo questo test, puliamo il database prima di ogni esecuzione.

source: Some could say the game had nothing to offer since then.
it_it: Alcuni potrebbero dire che da allora il gioco non ha più avuto nulla da offrire.

source: Some guys of my age already think they know all about coding, are bored with it and cannot wait until they move to management or requirements or business analysis, but hey!
it_it: Qualcuno della mia età pensa già di sapere tutto sulla programmazione, si annoiano e non vedono l'ora di passare alla gestione, ai requisiti o all'analisi aziendale, ma ehi!

source: Some magazines published lists of new juggles each month and the hype has stayed in the gaming community for well over a year.
it_it: Alcune riviste pubblicavano elenchi di nuove juggles ogni mese ed è rimasto di moda nella comunità dei giocatori per oltre un anno.

source: Some of them were only usable in certain situations, others were something I could throw at my opponent almost anytime without a big risk of being exposed to counterattacks.
it_it: Alcuni di essi erano utilizzabili solo in determinate situazioni, altri erano qualcosa che potevo lanciare al mio avversario quasi in qualsiasi momento senza correre il rischio di essere esposto a contrattacchi.

source: Some of us may only have a vague knowledge of what the real costs and benefits of TDD are.
it_it: Alcuni di noi potrebbero avere solo una vaga conoscenza di quali siano i costi e i benefici reali del TDD.

source: Some people I talk to about TDD sum up what I say to them as, "This is demotivating -- there are so many things I have to watch out for, that it makes me never want to start!".
it_it: Alcune persone con cui parlo del TDD riassumono ciò che dico loro in questo modo: "Questo è demotivante: ci sono così tante cose a cui devo prestare attenzione, che non mi viene voglia di iniziare!".

source: Sometimes, the interface implementations can be generated at runtime (like in Java or C#), sometimes we have to rely more on compile-time generation (e.g. in C++).
it_it: A volte, le implementazioni dell'interfaccia possono essere generate a runtime (come in Java o in C#), a volte dobbiamo fare più affidamento sulla generazione in fase di compilazione (ad esempio in C++).

source: Soon you'll need to write a lot of other methods similar to AssertTwoIntegersAreEqual() -- the one we already have compares two integers for equality, but what if we wanted to check a different condition, e.g. that one integer is greater than another?
it_it: Presto dovrai scrivere molti altri metodi simili a AssertTwoIntegersAreEqual() -- quello che già abbiamo confronta due numeri interi per verificarne l'uguaglianza, ma cosa succederebbe se volessimo verificare una condizione diversa, ad es. che un numero intero è maggiore di un altro?

source: Such frameworks are in principle based on the very idea that I sketched above, plus they make up for the deficiencies of our primitive approach.
it_it: Tali framework sono in linea di principio basate proprio sull’idea che ho abbozzato sopra, inoltre compensano le carenze del nostro approccio primitivo.

source: Such motivation may be difficult to sustain over the long term.
it_it: Tale motivazione può essere difficile da sostenere a lungo termine.

source: Such testing session could look like this:
it_it: Tale sessione di test potrebbe assomigliare a questa:

source: Summary
it_it: Riepilogo

source: Surprise, surprise, there is one!
it_it: Sorpresa, sorpresa, ce n'è una!

source: TDD is like Tekken.
it_it: TDD è come Tekken.

source: Test framework
it_it: Framework di test

source: Thankfully, if we make our classes depend on interfaces rather than other classes, we can easily implement those interfaces with special "fake" classes that can be crafted in a way that makes our testing easier.
it_it: Per fortuna, se facciamo in modo che le nostre classi dipendano da interfacce anziché da altre classi, possiamo facilmente implementare tali interfacce con speciali classi "fake" che possono essere realizzate in modo da semplificare i nostri test.

source: Thankfully, some smart programmers created libraries that provide further automation in such scenarios.
it_it: Per fortuna, alcuni programmatori intelligenti hanno creato librerie che forniscono ulteriore automazione in tali scenari.

source: That makes me want to ask you an important question that may help you decide whether you want to read on: why do you want to learn TDD?
it_it: Questo mi fa venir voglia di porre una domanda importante che potrebbe aiutare a decidere se continuare a leggere: perché imparare il TDD?

source: The AssertTwoIntegersAreEqual() method is an Assertion -- a condition that, when not met, ends a test with failure.
it_it: Il metodo AssertTwoIntegersAreEqual() è una Assertion -- una condizione che, se non soddisfatta, termina un test con un fallimento.

source: The Assertion takes the form of a call to the static Assert.Equal() method -- the xUnit.NET framework is bundled with a wide range of assertion methods, so I used one of them.
it_it: La Assertion assume la forma di una chiamata al metodo statico Assert.Equal() -- il framework xUnit.NET è fornito in bundle con un'ampia gamma di metodi di asserzione, quindi ne usai uno.

source: The Main() method serves as a Test List -- a place where it is decided which tests to run.
it_it: Il metodo Main() funge da Test List -- un posto in cui si decide quali test eseguire.

source: The Multiplication_ShouldResultInAMultiplicationOfTwoPassedNumbers() method is a Test Method.
it_it: Il metodo Multiplication_ShouldResultInAMultiplicationOfTwoPassedNumbers() è un Test Method.
